<?php

return [
    'accepted'             => 'يجب قبول الحقل :attribute',
    'active_url'           => 'الحقل :attribute لا يُمثّل رابطًا صحيحًا',
    'after'                => 'يجب على الحقل :attribute أن يكون تاريخًا لاحقًا للتاريخ :date.',
    'after_or_equal'       => 'الحقل :attribute يجب أن يكون تاريخاً لاحقاً أو مطابقاً للتاريخ :date.',
    'alpha'                => 'يجب أن لا يحتوي الحقل :attribute سوى على حروف',
    'alpha_dash'           => 'يجب أن لا يحتوي الحقل :attribute على حروف، أرقام ومطّات.',
    'alpha_num'            => 'يجب أن يحتوي :attribute على حروفٍ وأرقامٍ فقط',
    'array'                => 'يجب أن يكون الحقل :attribute ًمصفوفة',
    'before'               => 'يجب على الحقل :attribute أن يكون تاريخًا سابقًا للتاريخ :date.',
    'before_or_equal'      => 'الحقل :attribute يجب أن يكون تاريخا سابقا أو مطابقا للتاريخ :date',
    'between'              => [
        'numeric' => 'يجب أن تكون قيمة :attribute بين :min و :max.',
        'file'    => 'يجب أن يكون حجم الملف :attribute بين :min و :max كيلوبايت.',
        'string'  => 'يجب أن يكون عدد حروف النّص :attribute بين :min و :max',
        'array'   => 'يجب أن يحتوي :attribute على عدد من العناصر بين :min و :max',
    ],
    'boolean'              => 'يجب أن تكون قيمة الحقل :attribute إما true أو false ',
    'confirmed'            => 'حقل التأكيد غير مُطابق للحقل :attribute',
    'date'                 => 'الحقل :attribute ليس تاريخًا صحيحًا',
    'date_format'          => 'لا يتوافق الحقل :attribute مع الشكل :format.',
    'different'            => 'يجب أن يكون الحقلان :attribute و :other مُختلفان',
    'digits'               => 'يجب أن يحتوي الحقل :attribute على :digits رقمًا/أرقام',
    'digits_between'       => 'يجب أن يحتوي الحقل :attribute بين :min و :max رقمًا/أرقام ',
    'dimensions'           => 'الـ :attribute يحتوي على أبعاد صورة غير صالحة.',
    'distinct'             => 'للحقل :attribute قيمة مُكرّرة.',
    'email'                => 'يجب أن يكون :attribute عنوان بريد إلكتروني صحيح البُنية',
    'exists'               => 'الحقل :attribute لاغٍ',
    'file'                 => 'الـ :attribute يجب أن يكون من ملفا.',
    'filled'               => 'الحقل :attribute إجباري',
    'image'                => 'يجب أن يكون الحقل :attribute صورةً',
    'in'                   => 'الحقل :attribute لاغٍ',
    'in_array'             => 'الحقل :attribute غير موجود في :other.',
    'integer'              => 'يجب أن يكون الحقل :attribute عددًا صحيحًا',
    'ip'                   => 'يجب أن يكون الحقل :attribute عنوان IP ذا بُنية صحيحة',
    'ipv4'                 => 'يجب أن يكون الحقل :attribute عنوان IPv4 ذا بنية صحيحة.',
    'ipv6'                 => 'يجب أن يكون الحقل :attribute عنوان IPv6 ذا بنية صحيحة.',
    'json'                 => 'يجب أن يكون الحقل :attribute نصا من نوع JSON.',
    'max'                  => [
        'numeric' => 'يجب أن تكون قيمة الحقل :attribute مساوية أو أصغر لـ :max.',
        'file'    => 'يجب أن لا يتجاوز حجم الملف :attribute :max كيلوبايت',
        'string'  => 'يجب أن لا يتجاوز طول نص :attribute :max حروفٍ/حرفًا',
        'array'   => 'يجب أن لا يحتوي الحقل :attribute على أكثر من :max عناصر/عنصر.',
    ],
    'mimes'                => 'يجب أن يكون الحقل ملفًا من نوع : :values.',
    'mimetypes'            => 'يجب أن يكون الحقل ملفًا من نوع : :values.',
    'min'                  => [
        'numeric' => 'يجب أن تكون قيمة الحقل :attribute مساوية أو أكبر لـ :min.',
        'file'    => 'يجب أن يكون حجم الملف :attribute على الأقل :min كيلوبايت',
        'string'  => 'يجب أن يكون طول نص :attribute على الأقل :min حروفٍ/حرفًا',
        'array'   => 'يجب أن يحتوي الحقل :attribute على الأقل على :min عُنصرًا/عناصر',
    ],
    'not_in'               => 'الحقل :attribute لاغٍ',
    'numeric'              => 'يجب على الحقل :attribute أن يكون رقمًا',
    'present'              => 'يجب تقديم الحقل :attribute',
    'regex'                => 'صيغة الحقل :attribute .غير صحيحة',
    'required'             => 'الحقل :attribute مطلوب.',
    'required_if'          => 'الحقل :attribute مطلوب في حال ما إذا كان :other يساوي :value.',
    'required_unless'      => 'الحقل :attribute مطلوب في حال ما لم يكن :other يساوي :values.',
    'required_with'        => 'الحقل :attribute إذا توفّر :values.',
    'required_with_all'    => 'الحقل :attribute إذا توفّر :values.',
    'required_without'     => 'الحقل :attribute إذا لم يتوفّر :values.',
    'required_without_all' => 'الحقل :attribute إذا لم يتوفّر :values.',
    'same'                 => 'يجب أن يتطابق الحقل :attribute مع :other',
    'size'                 => [
        'numeric' => 'يجب أن تكون قيمة الحقل :attribute مساوية لـ :size',
        'file'    => 'يجب أن يكون حجم الملف :attribute :size كيلوبايت',
        'string'  => 'يجب أن يحتوي النص :attribute على :size حروفٍ/حرفًا بالظبط',
        'array'   => 'يجب أن يحتوي الحقل :attribute على :size عنصرٍ/عناصر بالظبط',
    ],
    'string'               => 'يجب أن يكون الحقل :attribute نصآ.',
    'timezone'             => 'يجب أن يكون :attribute نطاقًا زمنيًا صحيحًا',
    'unique'               => 'قيمة الحقل :attribute مُستخدمة من قبل',
    'uploaded'             => 'فشل في تحميل الـ :attribute',
    'url'                  => 'صيغة الرابط :attribute غير صحيحة',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes' => [



        'please_write_in_english'=>"برجاء الكتابة باللغة الانجليزية فقط",
        'login'=>'تسجيل الدخول',

        'name'                  => 'الاسم',
        'ar_name'               =>'الاسم بالعربية',
        'en_name'               =>' الاسم بالانجليزية',
        'username'              => 'اسم المُستخدم',
        'email'                 => 'البريد الالكتروني',
        'first_name'            => 'الاسم',
        'last_name'             => 'اسم العائلة',
        'password'              => 'كلمة المرور',
        'password_confirmation' => 'تأكيد كلمة المرور',
        'city'                  => 'المدينة',
        'country'               => 'الدولة',
        'address'               => 'العنوان',
        'phone'                 => 'الهاتف',
        'mobile'                => 'الجوال',
        'age'                   => 'العمر',
        'sex'                   => 'الجنس',
        'gender'                => 'النوع',
        'day'                   => 'اليوم',
        'month'                 => 'الشهر',
        'year'                  => 'السنة',
        'hour'                  => 'ساعة',
        'minute'                => 'دقيقة',
        'second'                => 'ثانية',
        'content'               => 'المُحتوى',
        'description'           => 'الوصف',
        'ar_description'           => 'الوصف بالعربية',
        'en_description'           => 'الوصف بالانجليزية',
        'excerpt'               => 'المُلخص',
        'date'                  => 'التاريخ',
        'time'                  => 'الوقت',
        'available'             => 'مُتاح',
        'size'                  => 'الحجم',
        'price'                 => 'السعر',
        'desc'                  => 'نبذه',
        'title'                 => 'العنوان',
        'ar_title'              =>'العنوان بالعربية',
        'q'                     => 'البحث',
        'link'                  => ' ',
        'slug'                  => ' ',
        'reset'    => 'تمت إعادة تعيين كلمة المرور',
        'sent'     => 'تم إرسال تفاصيل استعادة كلمة المرور الخاصة بك إلى بريدك الإلكتروني',
        'token'    => '.رمز استعادة كلمة المرور هذا غير صالح',
        'user'     => 'لم يتم العثور على أيّ حسابٍ بهذا العنوان الإلكتروني',
        'previous' => 'السابق',
        'next'     => 'التالي',
        'register'     => 'عمل حساب جديد',
        'newAccount'     => 'ليس لديك حساب ',
        'HomeMain'=>'الرئيسية',
        'products'     => 'المنتجات',
        'brochure'     => 'كتالوج',
        'earn more'     => 'زود دخلك ',
        'product'     => 'منتج',
        'special offers'     => 'عروض مميزه',
        'orders'     => 'الطلبات',
        'order'     => 'طلب',
        'profile'     => 'الملف الشخصى',
        'view'=>'عرض',
        'add'=>'اضافة',
        'edit'=>'تعديل',
        'order_new'=>'الطلبات الجديد',
        'order_preparing'=>'الطلبات قيد التحضير  ',
        'order_delivering'=>'الطلبات قيد التوصيل ',
        'order_delivered'=>'الطلبات تم التوصيل',
        'order_completed'=>'الطلبات المنتهية',
        'order_prepared'=>'الطلبات تم التحضير',
        'appName'=>'دكانك',

        'preparing'=>'قيد التحضير',
        'delivering'=>'قيد التوصيل ',
        'delivered'=>'تم التوصيل',
        'completed'=>'المنتهية',
        'prepared'=>'تم التحضير',
        'stoke'=>'الكميه المتاحه',
        'category'=>'التصنيف',
        'offers'=>'العروض',
        'brands'=>'الماركات',
        'images'=>'الصور',
        'submit'=>'حفظ',
        'status'=>'الحالة',
        'control'=>'التحكم',
        'published'=>'منشور',
        'unpublished'=>'غير منشور',
        'delete'=>'حذف',
        'search'=>'بحث',
        'discount'=>'الخصم',
        'sold_count'=>'الكميه المتاحه',
        'rate'=>'التقيم',
        'payment_method'=>'طريقة التوصيل',
        'online'=>'اونلاين',
        'cash'=>'عند الاستلام',
        'order_status'=>'حالة الطلب',
        'vendors'=>'الاسر المنتجة',
        'vendor'=>'الاسرة المنتجة',
        'total'=>'التكلفه الكليه',
        'change'=>'تغيير',
        'quantity'=>'الكمية',
        'delivery'=>'لديه توصيل',
        'image'=>'صورة',
        'cover'=>'الغلاف',
        'number'=>'عدد',
        'national_id'=>'الرقم القومى',
        'area'=>'المنطقة',
        'package'=>'الباقة',
        'package_name'=>'اسم الباقة',
        'package_price'=>'سعر الباقة',
        'location'=>'الموقع',
        'currencies'=>'العملات',
        'logout'=>'الخروج',
        'Overview_Description'=>'عرض التفاصيل',
        'netting_hub'=>'Netting Hub',
        'go_free'=>'اذهب مجانى',
        'go_premium'=>'اذهب لحساب مميز'  ,
        'home'=> 'الصفحة الرئيسية' ,
        'about_us'=>'معلومات عنا'  ,
        'how_it_work'=>'كيف تعمل',
        'shopping_categories'=> 'فئات التسوق',
        'free'=>'مجانا',
        'premium'=>'مميز',
        'contact_us'=>'اتصل بنا' ,
        'follow_us'=>'تابعنا',
        'plans'=>'الخطط' ,
        'what_is_nettinhhub'=>'ما هو Netting Hub؟',
        'read_more'=>'اقرأ أكثر',
        'read_less'=>'أقرأ أقل',
        'our_value'=>'قيمتنا',
        'our_mission'=>'مهمتنا',
        'our_vision'=>'رؤيتنا',
        'our_process'=>'عمليتنا',
        'go_free_30'=>'لو حابب تستكشف لمدة 15 يوم و تقرر لاحقاَ، كل اللى عليك تعمله إنك تدخل على صفحة الحساب المجانى و تكمل الخطوات التالية: '
        ,
        'AND_BENEFIT_FROM_THE_BELOW'=>'والاستفادة من أدناه',
        'sing_up'=>'التسجيل',
        'contact_us_message' =>'لا تتردد في التواصل مع أي استفسارات ، وستساعدنا ملاحظاتك في التحسن',
        'eamil'=>'البريد الإلكتروني',
        'massage'=>'رسالة',
        'phone'=>'أدخل هاتفك',
        'send' =>'أرسل',
        'middle_name'=>'الاسم الاوسط',
        'male'=>'ذكر ',
        'female'=>'انثى',
        'email'=>'البريد الالكترونى ',
        'birthday'=>'تاريخ الميلاد',
        'address'=>'العنوان ',
        'city'=>'المدينه',
        'select_city_first'=>'اختر مدينه اولا',
        'building_number'=>'رقم العمارة ',
        'floor_number'=>'رقم الدور ',
        'apartment_number'=>' رقم الشقه',
        'landmark'=>'المميز',
        'telephone'=>'رقم التلفيفون ',
        'id_number'=>'البطاقة الشخصية',
        'front_id'=>'وجه البطاقه ',
        'back_id'=>'ظهر البطاقه',
        'id_message'=>'يرجى تقديم صورة بطاقة الهوية الخاصة بك من أجل إصدار البطاقة المصرفية لتلقي العمولات حسابك',
        'read_contract'=>'يرجى قراءه العقد قبل اتمام حفظ البيانات ',
        'contact_text'=>'الموافق ساعته وتاريخ االطالع على الملف فيما بين كال من : الطرفين حرر هذا العقد
أوال: شركة أخناتون للتجارة والتوزيع ش.م.م خاضعة ألحكام القانون رقم 951/9199 - الكائن مقرها 9 ش الشركات - عابدين - جمهورية مصر العربية
ويمثلها فى هذا العقد السيد األستاذ / هشام محمود عويس بصفته رئيس مجلس االدارة للشركة و يشار إلية فيما بعد بـ " الطرف أول"
ثانيا: األستاذ / المشترك بحسب البيانات المسجلة بطاقة رقم قومى/ المسجلة والمدرج صورتها على البرنامج الجنسية : مصرى مقيم فى/ العنوان الموضح
بالبرنامج والمسجل ببطاقة الرقم القومى و يشار إلية فيما بعد " الطرف ثانى "
 تمهيد
الطرف األول شركة مساهمه مصرية وغرضها توزيع مستحضرات التجميل ,و التجارة العامة و التوزيع فحى كحل محاهو مسحمو بحه قانونحا ولمحا كحان الطحرف
الثانى - القابل لذلك - يرغب في ان يكون عميل مشترك لدي برنامج نتينج هاب علي شبكة االنترنت ) الموقع االفتراضي ( و أقر الطرف الثاني بقدرتحه علحى
إنجاز عمليات متابعة المشتركين الجدد من خاللة وبالشكل الذى يأمله الطرف األول وقحد تمحت الموافقحة محن الطحرف الثحاني عحن طريحق الحـ Application (
Digital ) بالموافقة عن طريق اشتراكة في البرنامج عن طريق قيام الطرف االول بارسال رسحالة نصحية الحي التليفحون المحمحول والبريحد االلكترونحى الخحا
بالطرف الثاني بما يفيد اشتراكة لدي الطرف االول وبعد أن أقر الطرفين بأهليتهما القانونية للتعاقد إتفقا فيما بينهما على ما يلى :
اوال
يعتبرالتمهيد السابق جزء ال يتجزاء من هذا العقد.
ثانيا
بموجب هذا العقد يرغب في ان يكون عميل مشترك لدي برنامج نتينج هاب علي شبكة االنترنت ) الموقع االفتراضي ( لدي الطرف االول .
ثالثا
5/9 . يستحق الطرف الثانى مقابل قيامة بادخال عمالء جدد ليقوم باالشتراك في البرنحامج عمولحة تححدد الحقحا وفقحا العمحال الطحرف االول محع الطحرف الثحانى
تستحق فى فى الشهر التالى.
5/2 . من المتفـق عليـه أن يتـم خصم الضرائب المســـتحقة من الطرف الثانى و آيه رسوم أو استقطاعات أخرى تن عليها القوانين .
5/3 . للطرف األول مطلق الحرية فى إختيار الطريقة التى يدفع بها مستحقات الطرف الثانى المذكور اعاله فى يكون السداد عن طريق التحويل البنكى لحساب
الطرف الثانى و فى هذه الحالة تبراء ذمة الطرف األول تجاه الطرف الثانى بهذا الخصو بمجرد تحويل مبلغ المستحق.
رابعا
يلتزم الطرف الثانى بما يلى :
7/9 . القيام بواجباتة لدى الطرف األول طبقا لشروط هذا العقد وطبقا ألحكام القوانين و اللوائ المعمول بها في جمهوريحة مصحر العربيحة والتحى اطلحع عليهحا
الطرف الثانى و قبلها .
7/2 . بعدم قبول أى أموال أو عمولة أو هدايا من أى نوع من العمالء نظير قيامه بادخال عمالء جدد والمسندة إليه من الطرف األول وكحذلك عحدم اإلقتحرا
من عمالء الطرف األول .
خامسا
يلتزم الطرف الثانى بأن يقدم للطرف األول كافة المستندات و البيانات المطلوبة منه للبدء فى العمل مع الطرف االول كما يلتزم بإخطار الطرف األول بأى تعديل
يطرأ على هذه البيانات أو المستندات خالل أسبوع على األكثر من تاريخ حدوث هذا التغيير و يكون مسئوال عن صحة تلك البيانات و المستندات و تقديمها فى
المواعيد المحددة و إال أعتبر العقد مفسوخا من تلقاء نفسة دون الحاجة إلى تنبية أو إنذار أو ثمة إجراءات أو الحصول على حكم يقضى بذلك .
سادسا
6/9 . يلتزم الطرف الثانى فى كل األوقات و تحت أى ظرف من الظروف بالحفاظ على سرية المعلومات المتعلقة بالطرف األول أو بأى من عمالءة أو شركاءه
فى العمل و ال يشترط أن تكون هذه المعلومات تحمل صفة السرية بل يمتد نطاق الحماية الى المعلومات كافة ، و من المتفق علية أن يمتد هحذا األلتحزام خحالل
فترة التعاقد و بعد إنتهاء فترة التعاقد أيضا ايا ما كان سبب هذا األنهاء و لغير فترة محدده و يشمل هذا األلتزام كافة األوراق الداخلية و األنظمة المعمول بها
فى الشركة الطرف االول وكذلك كافة برامج الحواسب والبنية التحتية لشبكة المعلومات الداخلية و كذا أسعار العموالت و أربا الشركة و خططها التسويقية و
التنموية و كافة العقود و المستندات و المراسالت و المكاتبات علما بأن ما ذكر على سحبيل المثحال و لحيس الحصحر و يححتفظ الطحرف األول محن األن بحقحه فحى
إتخاذ اإلجراءات القانونية ضد الطرف الثانى فى حـاله انتهاك سرية المعلومات الخاصة به و اإلفصا عنها الى طرف ثالث أيا ما كانت األسباب و كذلك بحقة
فى التعوي أن كان لة مقتضى .
6/2 . باختيار التعاقد ، يتنازل الطرف الثانى مقدما للطرف األول على وجه الخصو ، و بحدو ن ححد لعموميحة محا ذكحر انفحا عحن ححق نشحر محا يملكحه أو يحدعى
ملكيته، و يتصل بأية مادة علمية أو أى عمل آخر من إبداعه، سواء كان منفردا به أو بالتعاون مع آخحرين، وسحواء اخترعحه لعملحه أو فحى نطحاق العمحل الحذى
يقوم به و ذلك فى نطاق العمل فقط.
سابعا
يحق للطرف األول إنهاء العقد من جانبه و بعد إتخاذ اإلجراءات القانونية فى الحاالت األتية:
7/9 . إذا لم يلتزم الطرف الثانى بأحكام وشروط هذا العقد أو لم يلتزم بقواعد ولوائ وسياسات الطرف األول.
7/2 . إذا ارتكب الطرف الثانى خطأ جسيما أو خطا متعمدا تنشأ عنه خسائر فادحة للطرف األول.
7/3 . اذا قدم الطرف الثانى للطرف األول أية مستندات أو معلومات أو بيانات غيـر صحيحة تتعلق بالبيانات الشـخصية و التى على اساسها تم تعيينة .
7/4 . اذا أفشى سر من أسرار الطرف األول أو إنتهك سرية المعلومات و أفص عن أيا من المعلومات المحمية و يكون تقدير كون هذه المعلومة محمية أو
غير محمية للطرف األول وحده .
7/5 . اذا قام الطرف الثاني بمنافسة الطرف االول في ذات نشاطه او التحق اثناء عمله بشركة اخري منافسة أو ادي بها أو أنجز لها أي عمل من األعمال .
7/6 . يلتزم الطرف الثاني بالحفاظ علي سرية المبالغ المحوله اليه وعدم اطالع أحد عليه.
و يحق للطرف األول في هذه الحاالت مطالبة الطرف الثاني بالتعوي المناسب.
ثامنا
كل نزاع ينشأ بين الطرفين خاصأ بتنفيذ أو تفسير أي بند من بنود هذا العقد يكون الفصل فيه من اختصا محاكم جنوب القاهرة بجزئيتها
',

'free_account_plan'=>' خطة حساب مجانية
'
,

'sing_up_free'=>'اشترك مجانا',

'or_go_premium'=>'او اذهب لحساب مميز'
,

'sing_in'=> 'تسجيل الدخول',

'thank_you'=> 'شكرا لك ',
'thank_you_words'=> 'راجع بريدك الالكتروني ورسائل المحمول علشان نبعتلك عليه خطوات ازاى تكمل حسابك ' ,

'having_trouble' => 'فى مشكلة بتوجهك؟',
'you_are_registered_go_app'=> 'تم التسجيل من قبل رجاء الذهاب الى تطبيق الهاتف ',
'email_or_phone_wrong' => 'الهاتف او البريد الالكترونى خطئ'

,"thank_you_for_pay" => 'مبروك لقد تم اضافه طلبك بنجاح ',
        "whatsphone"=>'٦٨٥٠-٢٢٤٣-٠١٢'

    ],

];
